a = int(input('Enter a = '))
b = int(input('Enter b = '))
tot = 0
i = 0
while tot < a:
    tot += b
    i += 1
print(i)
#Даны положительные числа A и B (A > B). На отрезке длины A размещено максимально возможное количество отрезков длины B (без наложений). Не используя операции умножения и деления, найти количество
#отрезков B, размещенных на отрезке A.
